package LineExpressions18;

public class lineinieVirazhenia18 {

	public static void main(String[] args) {
		// Дана длина ребра куба. Найти площадь грани, площадь полной поверхности и
		// объем этого куба.
		int a = 12;
		int S_reb = a * a;
		int S_poln = 6 * S_reb;
		int ob = a * a * a;
		System.out.println("Ploshcad grani " + S_reb);
		System.out.println("Ploshcad polnoy powerh " + S_poln);
		System.out.println("Ob'em " + ob);

	}

}
